app/controllers/chapters_controller.rb

SELECT * FROM "chapters" WHERE ("chapters"."page_id" IN ('--- :id
---
  def index

	  @page_session = find_album

	  for npage in @page_session.npages
	  	#link_image =  npage.id.picture_folder + "/"
	  	s_page = npage.id
	  end

  	@chapters = Chapter.find(:all, :conditions => {:page_id => s_page}, :order => "page_id, position")

SELECT * FROM "chapters" WHERE ("chapters"."id" = 1)
---
  def show
    @chapter = Chapter.find(params[:id])

SELECT * FROM "chapters" WHERE ("chapters"."id" = 2)
---
  def edit
    @chapter = Chapter.find(params[:id])

INSERT INTO "chapters" ("image_url", "updated_at", "page_id", "title2", "description", "date_chapter", "created_at") VALUES('', '2010-04-06 19:40:33', 1, 'First day', 'This is the first day', '2010-04-06 19:39:00', '2010-04-06 19:40:33')
---
  def create
    @chapter = Chapter.new(params[:chapter])

    respond_to do |format|
      if @chapter.save

SELECT * FROM "chapters" WHERE ("chapters"."id" = 1)
UPDATE "chapters" SET "image_url" = '/images/castelnaud/R_castelnaud_IMG_6712.JPG', "updated_at" = '2010-04-20 19:04:26' WHERE "id" = 10
---
  def update
    @chapter = Chapter.find(params[:id])

    respond_to do |format|
      if @chapter.update_attributes(params[:chapter])

SELECT * FROM "chapters" WHERE ("chapters"."id" = 1)
DELETE FROM "chapters" WHERE "id" = 1
---
  def destroy
    @chapter = Chapter.find(params[:id])
    @chapter.destroy