app/controllers/liste_controller.rb

SELECT * FROM "pages" ORDER BY date_page
---
  def index
      @pages = Page.find_pages_for_display

SELECT * FROM "pages" ORDER BY date_page
SELECT * FROM "pages" WHERE ("pages"."id" = 7)
---
  def show
    @pages = Page.find_pages_for_display
    @chapters = Chapter.find_chapters_for_display(params[:id])

    @page = Page.find(params[:id])