app/controllers/pages_controller.rb

SELECT * FROM "pages"
---
  def index
    @pages = Page.all

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO "pages" ("updated_at", "title", "date_page", "page_description", "picture_page", "picture_folder", "created_at") VALUES('2010-04-23 18:38:45', 'Voyage à New York (11 - 2008)', NULL, NULL, NULL, 'newyork', '2010-04-23 18:38:45')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

SELECT * FROM "pages" WHERE ("pages"."id" = 6)
UPDATE "pages" SET "updated_at" = '2010-04-22 23:55:27', "picture_folder" = 'castelnaud' WHERE "id" = 7
---
  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
DELETE FROM "pages" WHERE "id" = 1
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy